system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 50;

vertices
(
  (-0.5 -0.5  0.5 ) //  0
  ( 0.5 -0.5  0.5 ) //  1
  ( 0.5  0.5  0.5 ) //  2 
  (-0.5  0.5  0.5 ) //  3 

  (-0.5 -0.5 -0.5 ) //  4 
  ( 0.5 -0.5 -0.5 ) //  5
  ( 0.5  0.5 -0.5 ) //  6 
  (-0.5  0.5 -0.5 ) //  7 

);

blocks
(
    hex (0 1 5 4 3 2 6 7)   ( 10 10 10 ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0 3 7 4 )
        );
    }
    outlet
    {
        type patch;
        faces
        (
            ( 1 2 6 5 )
        );
    }
    bottom 
    {
        type symmetryPlane;
        faces
        (
            ( 4 5 6 7 )
        );
    }
    top 
    {
        type symmetryPlane;
        faces
        (
            ( 0 1 2 3 )
        );
    }
);

// ************************************************************************* //
